cases/2D/method_comparison/2D_dambreak_Bn0p10_hr1_pureALG/constant/g
FoamFile { version 2.0; format ascii; class uniformDimensionedVectorField; object g; }
dimensions [0 1 -2 0 0 0 0];
value (0 0 -9.81);
