cases/2D/method_comparison/2D_dambreak_Bn0p10_hr1_pureALG/constant/transportProperties
FoamFile { version 2.0; format ascii; class dictionary; object transportProperties; }
phases (mayo air);

mayo
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0]   1e-3;        // ν_mayo = κ/ρ = 0.001/1000
    rho             [1 -3 0 0 0 0 0]   1000;
}

air
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0]   1.5e-5;
    rho             [1 -3 0 0 0 0 0]   1;
}

sigma  [1 0 -2 0 0 0 0]  0.0;

// ====================================================================
//   Augmented-Lagrangian Bingham parameters (mayonnaise only)
// ====================================================================
nuMayo  [0 2 -1 0 0 0 0]   1e-3;          // same as mayo nu (kinematic)
tau_y   [0 2 -2 0 0 0 0]   0.0981;        // 98.1 Pa / 1000 → kinematic
r_alg   [0 2 -1 0 0 0 0]   1e-3;          // 100·nu — start, will tune
alphaAlg                   0.3;

// Hybrid sub-yield damping — EXPLICITLY DISABLED for true Pure ALG
mPap                       0;
muMaxKin                   0;
gammaMin                   0;
