cases/2D/method_comparison/2D_dambreak_Bn0p10_hr1_pureALG/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }
scale 1;
vertices ( (0 0 0) (0.01 0 0) (0.01 0.8 0) (0 0.8 0) (0 0 0.4) (0.01 0 0.4) (0.01 0.8 0.4) (0 0.8 0.4) );
blocks ( hex (0 1 2 3 4 5 6 7) (1 400 200) simpleGrading (1 1 1) );
edges ();
boundary
(
    lowerWall   { type wall;          faces ( (0 3 2 1) ); }
    atmosphere  { type patch;         faces ( (4 5 6 7) ); }
    rightWall   { type wall;          faces ( (3 7 6 2) ); }
    leftWall    { type symmetryPlane; faces ( (0 1 5 4) ); }
    frontAndBack{ type empty;         faces ( (0 4 7 3) (1 2 6 5) ); }
);
mergePatchPairs ();
