cases/2D/method_comparison/2D_dambreak_Bn0p10_hr1_pureALG/system/setFieldsDict
FoamFile { version 2.0; format ascii; class dictionary; object setFieldsDict; }
defaultFieldValues ( volScalarFieldValue alpha.mayo 0 volVectorFieldValue U (0 0 0) );
regions ( boxToCell { box (-1e-6 -1e-6 -1e-6) (0.01 0.1 0.1001); fieldValues ( volScalarFieldValue alpha.mayo 1 ); } );
